PayPalAPISoapBinding.MassPay.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="urn:ebay:apis:CoreComponentTypes"
    xmlns:ns4="urn:ebay:apis:EnhancedDataTypes"
    xmlns:ns3="urn:ebay:apis:eBLBaseComponents"
    xmlns:ns1="urn:ebay:api:PayPalAPI">
 <SOAP-ENV:Header>
  <ns1:RequesterCredentials>
   <ns3:eBayAuthToken></ns3:eBayAuthToken>
   <ns3:HardExpirationWarning></ns3:HardExpirationWarning>
   <ns3:Credentials>
    <ns3:AppId></ns3:AppId>
    <ns3:DevId></ns3:DevId>
    <ns3:AuthCert></ns3:AuthCert>
    <ns3:Username></ns3:Username>
    <ns3:Password></ns3:Password>
    <ns3:Signature></ns3:Signature>
    <ns3:Subject></ns3:Subject>
    <ns3:AuthToken></ns3:AuthToken>
   </ns3:Credentials>
  </ns1:RequesterCredentials>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:MassPayReq>
    <ns1:MassPayRequest>
     <ns1:EmailSubject></ns1:EmailSubject>
     <ns1:ReceiverType>EmailAddress</ns1:ReceiverType>
     <ns1:ButtonSource></ns1:ButtonSource>
     <ns1:MassPayItem>
      <ns1:ReceiverEmail></ns1:ReceiverEmail>
      <ns1:ReceiverPhone></ns1:ReceiverPhone>
      <ns1:ReceiverID></ns1:ReceiverID>
      <ns1:Amount currencyID="AFA"></ns1:Amount>
      <ns1:UniqueId></ns1:UniqueId>
      <ns1:Note></ns1:Note>
     </ns1:MassPayItem>
     <ns1:MassPayItem>
      <ns1:ReceiverEmail></ns1:ReceiverEmail>
      <ns1:ReceiverPhone></ns1:ReceiverPhone>
      <ns1:ReceiverID></ns1:ReceiverID>
      <ns1:Amount currencyID="AFA"></ns1:Amount>
      <ns1:UniqueId></ns1:UniqueId>
      <ns1:Note></ns1:Note>
     </ns1:MassPayItem>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:ErrorLanguage></ns1:ErrorLanguage>
     <ns1:Version></ns1:Version>
     <!-- extensibility element(s) -->
    </ns1:MassPayRequest>
   </ns1:MassPayReq>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
